In [60]:
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [61]:
ratings_file = "Resources/Book-Ratings.csv"

ratings_df = pd.read_csv(ratings_file, encoding='latin1', sep=';')
ratings_df.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [62]:
ratings_df.dtypes

User-ID         int64
ISBN           object
Book-Rating     int64
dtype: object

In [63]:
#ratings_split_df = pd.DataFrame(ratings_df.str.split(';',2).tolist(),columns = ['User-ID','ISBN','Book_Rating'])

In [64]:
#with open(ratings_file) as something:
#    print(something)

In [65]:
books_file = "Resources/Books.csv"
books_df = pd.read_csv(books_file)
books_df.head()

,id,book_id,best_book_id,work_id,books_count,isbn,isbn13,authors,original_publication_year,original_title,...,ratings_count,work_ratings_count,work_text_reviews_count,ratings_1,ratings_2,ratings_3,ratings_4,ratings_5,image_url,small_image_url
0,1,2767052,2767052,2792775,272,439023483,9.780439e+12,Suzanne Collins,2008.0,The Hunger Games,...,4780653,4942365,155254,66715,127936,560092,1481305,2706317,https://images.gr-assets.com/books/1447303603m...,https://images.gr-assets.com/books/1447303603s...
1,2,3,3,4640799,491,439554934,9.780440e+12,"J.K. Rowling, Mary GrandPré",1997.0,Harry Potter and the Philosopher's Stone,...,4602479,4800065,75867,75504,101676,455024,1156318,3011543,https://images.gr-assets.com/books/1474154022m...,https://images.gr-assets.com/books/1474154022s...
2,3,41865,41865,3212258,226,316015849,9.780316e+12,Stephenie Meyer,2005.0,Twilight,...,3866839,3916824,95009,456191,436802,793319,875073,1355439,https://images.gr-assets.com/books/1361039443m...,https://images.gr-assets.com/books/1361039443s...
3,4,2657,2657,3275794,487,61120081,9.780061e+12,Harper Lee,1960.0,To Kill a Mockingbird,...,3198671,3340896,72586,60427,117415,446835,1001952,1714267,https://images.gr-assets.com/books/1361975680m...,https://images.gr-assets.com/books/1361975680s...
4,5,4671,4671,245494,1356,743273567,9.780743e+12,F. Scott Fitzgerald,1925.0,The Great Gatsby,...,2683664,2773745,51992,86236,197621,606158,936012,947718,https://images.gr-assets.com/books/1490528560m...,https://images.gr-assets.com/books/1490528560s...

In [66]:
books_df.dtypes

id                             int64
book_id                        int64
best_book_id                   int64
work_id                        int64
books_count                    int64
isbn                          object
isbn13                       float64
authors                       object
original_publication_year    float64
original_title                object
title                         object
language_code                 object
average_rating               float64
ratings_count                  int64
work_ratings_count             int64
work_text_reviews_count        int64
ratings_1                      int64
ratings_2                      int64
ratings_3                      int64
ratings_4                      int64
ratings_5                      int64
image_url                     object
small_image_url               object
dtype: object

### Transform premise DataFrame

In [67]:
#Transform portion
##New Books Dataframe (clean)
books_transformed_df = books_df[['isbn', 'title','authors']]
books_transformed_df.head()

,isbn,title,authors
0,439023483,"The Hunger Games (The Hunger Games, #1)",Suzanne Collins
1,439554934,Harry Potter and the Sorcerer's Stone (Harry P...,"J.K. Rowling, Mary GrandPré"
2,316015849,"Twilight (Twilight, #1)",Stephenie Meyer
3,61120081,To Kill a Mockingbird,Harper Lee
4,743273567,The Great Gatsby,F. Scott Fitzgerald

In [72]:
#Renaming columns 
books_transformed_df.rename(columns={"isbn": "isbn",
                              "title": "book_title",
                              "authors": "book_author"},
                   inplace=True)

# Clean the data by dropping duplicates and setting the index
books_transformed_df.drop_duplicates("isbn", inplace=True)
books_transformed_df.set_index("isbn", inplace=True)

books_transformed_df.head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

,book_title,book_author
isbn,,
439023483,"The Hunger Games (The Hunger Games, #1)",Suzanne Collins
439554934,Harry Potter and the Sorcerer's Stone (Harry P...,"J.K. Rowling, Mary GrandPré"
316015849,"Twilight (Twilight, #1)",Stephenie Meyer
61120081,To Kill a Mockingbird,Harper Lee
743273567,The Great Gatsby,F. Scott Fitzgerald

### Transform ratings DataFrame

In [73]:
ratings_cols = ["User-ID","ISBN", "Book-Rating"]
ratings_transformed = ratings_df[ratings_cols].copy()

# Rename the column headers
ratings_transformed = ratings_transformed.rename(columns={"User-ID": "user_id",
                                                         "ISBN": "isbn",
                                                         "Book-Rating": "book_rating"})
# Set index
ratings_transformed.set_index("user_id", inplace=True)
#drop null value rows
ratings_transformed.dropna(inplace=True) 
ratings_transformed.head()

               isbn  book_rating
user_id
276725   034545104X            0
276726   0155061224            5
276727   0446520802            0
276729   052165615X            3
276729   0521795028            6

## JOIN TABLES

In [74]:
#use .join on df to join two dfs together 
joined_df = ratings_transformed.join (books_transformed_df, how="inner", on="isbn") 
joined_df.tail()

,isbn,book_rating,book_title,book_author
user_id,,,,
258534,1884365302,0,The Jungle,"Upton Sinclair, Earl Lee, Kathleen DeGrave"
270713,061808360X,8,Gorillas in the Mist,Dian Fossey
271526,446519138,9,Simple Abundance: A Daybook of Comfort and Joy,Sarah Ban Breathnach
274186,8466302948,1,"Pandora (New Tales of the Vampires, #1)",Anne Rice
275970,1566562937,0,Samarkand,"Amin Maalouf, Russell Harris"

### Create database connection

In [49]:
connection_string = "postgres:postgres@localhost:5432/bookworm_db"
engine = create_engine(f'postgresql://{connection_string}')

In [50]:
# Confirm tables
engine.table_names()

['books', 'ratings']

### Load DataFrames into database

In [51]:
books_transformed_df.to_sql(name='books', con=engine, if_exists='append', index=True)

In [54]:
ratings_transformed.to_sql(name='ratings', con=engine, if_exists='append', index=True)

In [55]:
engine.table_names()

['books', 'ratings']

In [75]:
joined_df.to_sql(name='books_ratings', con=engine, if_exists='append', index=True)

In [76]:
engine.table_names()

['books_ratings', 'books', 'ratings']